#+STARTUP: indent contents
#+OPTIONS: num:nil toc:nil
*** Execution
In order to run this you have to "tangle" the code first using =C-c
C-v C-t=.

#+BEGIN_SRC shell :tangle no :results output :exports both
  cd ada
  gnatmake day09
  ./day09
#+END_SRC

#+RESULTS:
: Advent of Code 2020 Day 09 -
: 
: The result for Part 1 is:  552655238
: The result for Part 2 is:  70672245
